[
  {
    "title": "Boogey Wedding – Save the Date",
    "category": "Promotion",
    "lead": "Halloween’s most powerful couple arrived — limited combo from 89K.",
    "content": "<h2>Boogey Wedding: Save the Date</h2><p>Wake up, folks! Halloween’s most powerful couple has officially appeared at Phuc Long. To celebrate, we present the <strong>Boogey Wedding combo</strong> — a playful pairing of bold tea blends and seasonal desserts, crafted to surprise and delight.</p><h3>What’s inside the combo?</h3><ul><li><strong>Mr. Boogey:</strong> A robust Black Tea base layered with Hibiscus and Red Plum notes — full-bodied and aromatic.</li><li><strong>Mrs. Boogey:</strong> A bright Hibiscus-forward drink with a delicate tang of Red Plum and a silky finish.</li><li><strong>Limited dessert:</strong> Purple longan mousse or spooky cake (choose one).</li></ul><p>Available in stores from <strong>Oct 1, 2025</strong>. This is a limited run — our recommended pairing helps balance the boldness of the tea with a soft, sweet finish from the dessert.</p><h3>Pairing tips</h3><ol><li>Choose <em>Mr. Boogey</em> with the richer dessert for contrast.</li><li>Choose <em>Mrs. Boogey</em> if you prefer a lighter, fruit-forward finish.</li></ol><p><em>Quick note:</em> combo price from <strong>89,000 VND</strong>. Drop by store or order via delivery partners while stocks last.</p>",
    "date_display": "2025-10-01",
    "attached_file": "/uploads/boogey-wedding.jpg",
    "like_count": 124,
    "comment_count": 18,
    "share_count": 34,
    "tags": ["PhucLong","Halloween","Promotion"],
    "created_at": "2025-10-01T08:00:00Z"
  },
  {
    "title": "Matcha Latte – Behind the Scenes",
    "category": "Brand Story",
    "lead": "Our Matcha process and sourcing story.",
    "content": "<h2>Matcha Latte – Behind the Scenes</h2><p>At Phuc Long, our Matcha Latte is more than a drink — it's a story of careful sourcing and precise technique. In this piece we walk through each step, from farm to cup.</p><h3>Sourcing</h3><p>We partner with smallholder farms that harvest young, tender tea leaves for matcha production. Leaves are shaded before harvest to increase chlorophyll, creating that vivid green and umami-rich flavor.</p><h3>Processing</h3><p>Leaves are stone-ground into a fine powder and tested for aroma and color. Our roasters then calibrate the ratio of matcha to milk for consistent texture and sweetness.</p><h3>How we prepare it</h3><ol><li>Whisk 1–1.5 tsp matcha with a splash of hot water until frothy.</li><li>Add steamed milk and a touch of syrup if desired.</li></ol><p>Enjoy it hot or iced—our baristas recommend a 1:3 matcha-to-milk ratio for balance. Want to taste the difference? Try it side-by-side with our single-origin matcha shots.</p>",
    "date_display": "2025-09-12",
    "attached_file": "/uploads/matcha-latte.jpg",
    "like_count": 78,
    "comment_count": 5,
    "share_count": 12,
    "tags": ["Matcha","Brand"],
    "created_at": "2025-09-12T09:30:00Z"
  },
  {
    "title": "How to Brew the Perfect Black Tea",
    "category": "Instruction",
    "lead": "Step-by-step guide for the best cup.",
    "content": "<h2>How to Brew the Perfect Black Tea</h2><p>Black tea rewards attention. With the right water temperature, steep time, and leaf quality, a perfect cup is easily within reach.</p><h3>Ingredients & Tools</h3><ul><li>Fresh cold water</li><li>Loose-leaf black tea (2–3 g per 200ml)</li><li>Kettle, teapot or infuser</li></ul><h3>Step-by-step</h3><ol><li><strong>Heat water:</strong> Bring to ~95°C (just below boiling).</li><li><strong>Preheat teapot:</strong> Rinse your teapot or cup with hot water.</li><li><strong>Measure leaves:</strong> Use 2–3 g of tea per cup.</li><li><strong>Steep time:</strong> 3–5 minutes depending on desired strength.</li></ol><p><strong>Tasting notes:</strong> Short steeping yields floral, delicate notes; longer steeping brings out malty, robust flavors. Try with a splash of milk or a slice of lemon.</p><h3>Advanced tip</h3><p>For iced black tea, brew 25% stronger, cool quickly, then pour over ice to retain brightness.</p>",
    "date_display": "2025-08-20",
    "attached_file": "/uploads/black-tea.jpg",
    "like_count": 210,
    "comment_count": 42,
    "share_count": 55,
    "tags": ["Tea","Guide"],
    "created_at": "2025-08-20T07:45:00Z"
  },
  {
    "title": "Halloween Special: Spine-Tingling Desserts",
    "category": "Promotion",
    "lead": "Limited-time spooky desserts to pair with your drink.",
    "content": "<h2>Halloween Special: Spine-Tingling Desserts</h2><p>This Halloween we’ve created a dessert lineup that’s equal parts spooky and delicious. Each item pairs perfectly with our seasonal drinks.</p><h3>Menu Highlights</h3><ul><li><strong>Purple Longan Mousse:</strong> light mousse infused with longan syrup and a hibiscus glaze.</li><li><strong>Black Cocoa Tart:</strong> crunchy tart shell with a silky dark chocolate pâté.</li><li><strong>Ghost Yogurt:</strong> creamy yogurt cup topped with berries and edible 'ghost' meringue.</li></ul><p>All desserts are available for a limited time. Want a pairing? Try the Purple Longan Mousse with Mr. Boogey for a contrast of bold and delicate flavors.</p><h3>Order tips</h3><p>Combos are available both in-store and through our delivery partners. Pre-order on weekends to avoid sell-outs.</p>",
    "date_display": "2025-10-15",
    "attached_file": "/uploads/halloween-dessert.jpg",
    "like_count": 53,
    "comment_count": 7,
    "share_count": 9,
    "tags": ["Halloween","Dessert"],
    "created_at": "2025-10-15T10:00:00Z"
  },
  {
    "title": "Customer Review: The New Yogurt Combo",
    "category": "Review",
    "lead": "Real customers share their thoughts.",
    "content": "<h2>Customer Review: The New Yogurt Combo</h2><p>We asked several customers to try the new Yogurt Combo and share honest feedback. Here are the highlights.</p><h3>What customers liked</h3><ul><li><strong>Texture:</strong> Many praised the creamy, velvety yogurt base.</li><li><strong>Balance:</strong> The fruit topping provided a nice acidity to cut through the richness.</li><li><strong>Value:</strong> Combo price felt reasonable for portion size.</li></ul><h3>What could be improved</h3><p>Some customers suggested a slightly reduced sweetness on certain days — we’re testing sugar-level options to fit different tastes.</p><p>If you’re curious, try ordering with a small syrup add-on to experiment with intensity.</p><blockquote>“Loved the freshness — perfect after a long walk.” — Mai, HCM</blockquote>",
    "date_display": "2025-07-10",
    "attached_file": "/uploads/yogurt-combo.jpg",
    "like_count": 19,
    "comment_count": 3,
    "share_count": 1,
    "tags": ["Review","Combo"],
    "created_at": "2025-07-10T14:20:00Z"
  },
  {
    "title": "Workshop Recap: Latte Art Basics",
    "category": "Workshop",
    "lead": "Photos and tips from our last workshop.",
    "content": "<h2>Workshop Recap: Latte Art Basics</h2><p>Our recent latte art workshop covered essential tools and techniques for building consistent microfoam and simple pours. Below are the key takeaways for home baristas.</p><h3>Tools we used</h3><ul><li>Steam wand with thermometer</li><li>Pitcher with narrow spout</li><li>Fresh espresso (18–20 g dose)</li></ul><h3>Key techniques</h3><ol><li><strong>Stretch and texture:</strong> introduce air early, then submerge to create microfoam.</li><li><strong>Swirl and tap:</strong> remove large bubbles and set a silky texture.</li><li><strong>Pours:</strong> start high for base, then lower the pitcher and move gently for design.</li></ol><p>Participants practiced hearts, rosettas, and simple tulips. Photos from the event are available at our store and social feed.</p>",
    "date_display": "2025-08-03",
    "attached_file": "/uploads/latte-art.jpg",
    "like_count": 95,
    "comment_count": 12,
    "share_count": 10,
    "tags": ["Workshop","Latte"],
    "created_at": "2025-08-03T17:00:00Z"
  },
  {
    "title": "Product Deep Dive: Hibiscus Infusion",
    "category": "Brand Story",
    "lead": "Explaining the health benefits and flavor profile.",
    "content": "<h2>Product Deep Dive: Hibiscus Infusion</h2><p>Hibiscus is more than a pretty color — it brings tart floral notes and a refreshing acidity that balances sweet elements very well. In this deep dive we explore flavor, sourcing, and serving suggestions.</p><h3>Flavor profile</h3><p>Tart, cranberry-like acidity with floral undernotes. Bright and crisp, hibiscus pairs well with stone fruits and citrus.</p><h3>Health highlights</h3><ul><li>Rich in vitamin C and antioxidants</li><li>Refreshing and naturally caffeine-free</li></ul><h3>Serving ideas</h3><ol><li>Iced hibiscus with mint and lime.</li><li>Hibiscus syrup as cocktail or mocktail base.</li><li>Pair hibiscus drink with creamy desserts to cut sweetness.</li></ol><p>We source hibiscus from vetted suppliers to ensure consistent aroma and color — it’s key to keeping flavor balanced across batches.</p>",
    "date_display": "2025-06-18",
    "attached_file": "/uploads/hibiscus.jpg",
    "like_count": 46,
    "comment_count": 2,
    "share_count": 4,
    "tags": ["Hibiscus","Product"],
    "created_at": "2025-06-18T11:10:00Z"
  },
  {
    "title": "5 Ways to Enjoy Iced Tea This Summer",
    "category": "Instruction",
    "lead": "Quick recipes to beat the heat.",
    "content": "<h2>5 Ways to Enjoy Iced Tea This Summer</h2><p>Hot weather calls for refreshing iced tea. Here are five quick recipes you can make at home or try our versions in-store.</p><h3>1. Classic Mint Iced Tea</h3><p>Brew strong black tea, cool, add fresh mint and a squeeze of lemon.</p><h3>2. Peach Iced Tea</h3><p>Steep tea with peach slices or use peach syrup for a sweeter twist.</p><h3>3. Hibiscus Cooler</h3><p>Brew hibiscus flowers, chill, add lime and a touch of honey.</p><h3>4. Jasmine Green Iced Tea</h3><p>Delicate floral notes, lightly sweetened — great with light snacks.</p><h3>5. Citrus Ginger Iced Tea</h3><p>Add ginger slices and orange peel during steeping for a spicy-citrus kick.</p><p><strong>Pro tip:</strong> brew slightly stronger than usual (about 1.25x), cool quickly, then serve over ice to keep flavor bright.</p>",
    "date_display": "2025-05-22",
    "attached_file": "/uploads/iced-tea.jpg",
    "like_count": 302,
    "comment_count": 66,
    "share_count": 71,
    "tags": ["Summer","Recipes"],
    "created_at": "2025-05-22T08:00:00Z"
  },
  {
    "title": "Exclusive ShopeeFood Offer",
    "category": "Promotion",
    "lead": "Discount code for ShopeeFood users.",
    "content": "<h2>Exclusive ShopeeFood Offer</h2><p>Good news for ShopeeFood customers — we’re running a limited-time discount to make your favorites more affordable. Use the code at checkout and enjoy savings on selected combos.</p><h3>How to use</h3><ol><li>Open ShopeeFood and find Phuc Long store.</li><li>Add your favorite combo to the cart.</li><li>Apply code <strong>PLFOOD20</strong> at checkout for 20% off (T&Cs apply).</li></ol><p>Offer valid while stocks last. Delivery fees may apply. This promotion may not be combined with other offers.</p><p>Prefer pick-up? The code works for pick-up orders as well — choose your nearest store at checkout.</p>",
    "date_display": "2025-09-01",
    "attached_file": "/uploads/shopee-offer.jpg",
    "like_count": 11,
    "comment_count": 0,
    "share_count": 2,
    "tags": ["ShopeeFood","Deal"],
    "created_at": "2025-09-01T10:30:00Z"
  },
  {
    "title": "Sustainability at Phuc Long",
    "category": "Brand Story",
    "lead": "How we reduce waste and support farmers.",
    "content": "<h2>Sustainability at Phuc Long</h2><p>Sustainability is central to how we source ingredients and run stores. From supporting responsible farming to reducing single-use waste, here are concrete steps we take.</p><h3>Farmer partnerships</h3><p>We work directly with smallholder farmers to improve crop quality and ensure fair prices. Long-term contracts help stabilize income for farming communities.</p><h3>Waste reduction</h3><ul><li>Encourage reusable cups with a discount.</li><li>Compost organic waste where possible.</li><li>Switch to recyclable packaging for takeout.</li></ul><h3>Continuous improvement</h3><p>We measure key sustainability indicators yearly and invest in projects that reduce carbon footprint and support farmer resilience. Join us in making small choices that add up — bring your reusable cup on your next visit.</p>",
    "date_display": "2025-04-30",
    "attached_file": "/uploads/sustainability.jpg",
    "like_count": 220,
    "comment_count": 29,
    "share_count": 18,
    "tags": ["Sustainability","CSR"],
    "created_at": "2025-04-30T09:15:00Z"
  }
]
